Revit 2026 API

# PointCloudColorSettings Properties

---

The PointCloudColorSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Color1 | Color 1 |
|  | Color2 | Color 2 |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

PointCloudColorSettings Class

Autodesk.Revit.DB.PointClouds Namespace